In [1]:
import boto3
from botocore import UNSIGNED
from botocore.client import Config

import pandas as pd
import pandas.io.sql as sqlio
import psycopg2
import numpy as np
import psycopg2.extras as extras

import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:

        connection = psycopg2.connect(
            database=db,
            user=user,
            password=pw,
            host=host,
            port=port
        )
        
        print("PostgreSql Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

pw = 'npF5SlOzvW'
db = "d2b_assessment" 
user='byroneji4734'
host='d2b-internal-assessment-dwh.cxeuj0ektqdz.eu-central-1.rds.amazonaws.com'
port = '5432'


connection = create_server_connection(host, user, pw)

PostgreSql Database connection successful

In [3]:
# create engine instance using sqlalchemy
#engine = create_engine('postgresql+psycopg2://byroneji4734:npF5SlOzvW@d2b-internal-assessment-dwh.cxeuj0ektqdz.eu-central-1.rds.amazonaws.com:5432/d2b_assessment?charset')
%config SQL.conn_name = 'connection'


#conn = psycopg2.connect(
  #  database="d2b_assessment", user='byroneji4734', password='npF5SlOzvW', host='d2b-internal-assessment-dwh.cxeuj0ektqdz.eu-central-1.rds.amazonaws.com', port='5432'
#)

# create connection object using sqlite3

#conn = sqlite3.connect('d2b_assessment.db')
#cursor = conn.cursor()



# Local file directories
# Testing environment needs.
source_path = "../data/Webpages/"
save_path = "output/"
index_file = '../'


s3 = boto3.client('s3', config=Config(signature_version=UNSIGNED))

bucket_name =  "d2b-internal-assessment-bucket"
Prefix='orders_data/'

response = s3.list_objects_v2(
    Bucket=bucket_name,
    Prefix=Prefix)

# # EC2 file directories
# source_path = "/home/ec2-user/s3-drive/Stocks/"
# save_path = "/home/ec2-user/s3-drive/Output/"
# index_file_path = "/home/ec2-user/s3-drive/CompanyNames/top_companies.txt"

In [6]:
#List and Download files from data lake

file_list = []

def source_list_download(res):
    for content in res.get('Contents', [])[1:]:
        trunc_key = (content['Key'].rsplit(Prefix))
        trunc_key = (','.join(trunc_key[1:]))
        #print(trunc_key)
        s3.download_file(bucket_name,content['Key'], trunc_key)
        file_list.append(trunc_key[:-4]) #create list of files ignoring the file extension(.csv)
        
source_list_download(response)

In [7]:
def download_from_source_bucket(bucket_objects_list):
    
    for file in bucket_objects_list:
        s3.download_file(bucket_name, "orders_data/"+file+".csv", file+".csv")

download_from_source_bucket(file_list)

In [ ]:
orders = pd.read_csv("orders.csv")
reviews = pd.read_csv("reviews.csv")
shipment_deliveries_pd = pd.read_csv("shipment_deliveries.csv")
shipment_deliveries_df = pd.DataFrame(shipment_deliveries_pd)
shipment_deliveries_df = shipment_deliveries_df.replace(np.nan, '1000-01-01',regex = True)
shipment_deliveries_df.head()

### LOAD DATA TO STAGING SCHEMA

In [8]:
def load_df_to_warehouse(conn, df, table):

    tuples = [list(row) for row in df.itertuples(index=False)]
    #tuples = [tuple(x) for x in df.to_numpy()]

    cols = ','.join(list(df.columns))
    
    # SQL query to execute
    query = "INSERT INTO %s(%s) VALUES %%s" % (table, cols)                   
    cursor = conn.cursor()
    
    try:
        extras.execute_values(cursor, query, tuples)
        conn.commit()
      
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        conn.rollback()
        cursor.close()
        return 1
    except psycopg2.InterfaceError:
        pass
    print("the dataframe is inserted")
    cursor.close()
    


#load_df_to_warehouse(conn, orders, 'byroneji4734_staging.orders')
#load_df_to_warehouse(conn, reviews, 'byroneji4734_staging.reviews')
#load_df_to_warehouse(conn, shipment_deliveries_df, 'byroneji4734_staging.shipment_deliveries')

# SQL TRANSFORMATION

In [ ]:
%%read_sql
--Replace strange date values to Null in the date columns

UPDATE byroneji4734_staging.shipment_deliveries
    SET shipment_date = Null
WHERE shipment_date = '1000-01-01';


UPDATE byroneji4734_staging.shipment_deliveries
    SET delivery_date = Null
WHERE delivery_date = '1000-01-01';

***1) The total number of orders placed on a public holiday every month, for the past year***

In [11]:
%%read_sql

SELECT
    CURRENT_DATE AS ingestion_date, 
    count(order_id) FILTER (WHERE month_of_the_year_num = 1) AS "tt_order_hol_jan",
    count(order_id) FILTER (WHERE month_of_the_year_num = 2) AS "tt_order_hol_feb",
    count(order_id) FILTER (WHERE month_of_the_year_num = 3) AS "tt_order_hol_mar",
    count(order_id) FILTER (WHERE month_of_the_year_num = 4) AS "tt_order_hol_apr",
    count(order_id) FILTER (WHERE month_of_the_year_num = 5) AS "tt_order_hol_may",
    count(order_id) FILTER (WHERE month_of_the_year_num = 6) AS "tt_order_hol_jun",
    count(order_id) FILTER (WHERE month_of_the_year_num = 7) AS "tt_order_hol_jul",
    count(order_id) FILTER (WHERE month_of_the_year_num = 8) AS "tt_order_hol_aug",
    count(order_id) FILTER (WHERE month_of_the_year_num = 9) AS "tt_order_hol_sep",
    count(order_id) FILTER (WHERE month_of_the_year_num = 10) AS "tt_order_hol_oct",
    count(order_id) FILTER (WHERE month_of_the_year_num = 11) AS "tt_order_hol_nov",
    count(order_id) FILTER (WHERE month_of_the_year_num = 12) AS "tt_order_hol_dec"
FROM byroneji4734_staging.dim_dates
JOIN byroneji4734_staging.orders
ON order_date = calender_dt
WHERE orders.order_date IN(

    SELECT calender_dt
    FROM byroneji4734_staging.dim_dates
    WHERE calender_dt >= CURRENT_DATE - INTERVAL '1 year'
    AND calender_dt <= CURRENT_DATE
    AND working_day = False
    AND day_of_the_week_num BETWEEN 1 AND 5
    GROUP BY month_of_the_year_num, calender_dt
    ORDER BY month_of_the_year_num
)

Query started at 10:11:29 PM W. Central Africa Standard Time; Query executed in 0.01 m

,ingestion_date,tt_order_hol_jan,tt_order_hol_feb,tt_order_hol_mar,tt_order_hol_apr,tt_order_hol_may,tt_order_hol_jun,tt_order_hol_jul,tt_order_hol_aug,tt_order_hol_sep,tt_order_hol_oct,tt_order_hol_nov,tt_order_hol_dec
0,2022-09-27,0,17,13,12,0,0,13,17,0,16,12,0

***Total number of undelivered shipments (Null delivery & Shipment dates, current date = 15 days after Order date***

In [12]:
%%read_sql

SELECT CURRENT_DATE AS ingestion_date, tt_late_shipments,  tt_undelivered_items
FROM 
(
    SELECT count(orders.order_date) AS tt_late_shipments
    FROM byroneji4734_staging.shipment_deliveries

    JOIN byroneji4734_staging.orders
    ON orders.order_id = shipment_deliveries.order_id
    WHERE shipment_date >= (orders.order_date + 6)
    AND shipment_deliveries.delivery_date IS Null
) 
    as x, 

(

    SELECT count(orders.order_date) as tt_undelivered_items
    FROM byroneji4734_staging.shipment_deliveries

    JOIN byroneji4734_staging.orders
    ON orders.order_id = shipment_deliveries.order_id
    WHERE shipment_date IS Null
    AND shipment_deliveries.delivery_date IS Null
    AND (order_date) + 15 = '2022-09-05'

) 

as y

Query started at 10:11:38 PM W. Central Africa Standard Time; Query executed in 0.00 m

  ingestion_date  tt_late_shipments  tt_undelivered_items
0     2022-09-27                175                    11

In [13]:
%%read_sql


SELECT count(review), product_id
FROM byroneji4734_staging.reviews
GROUP BY product_id 
ORDER BY count(review) DESC
LIMIT 1

Query started at 10:11:50 PM W. Central Africa Standard Time; Query executed in 0.00 m

   count  product_id
0    632          23

In [14]:
%%read_sql
SELECT *
FROM byroneji4734_staging.dim_products
WHERE dim_products.product_id = (


    SELECT product_id
    FROM byroneji4734_staging.reviews
    GROUP BY product_id 
    ORDER BY count(review) DESC
    LIMIT 1
    )

Query started at 10:11:54 PM W. Central Africa Standard Time; Query executed in 0.00 m

   product_id product_category product_name
0          23      Screwdriver        Tools

In [15]:
%%read_sql

SELECT calender_dt, day_of_the_week_num, working_day
FROM byroneji4734_staging.dim_dates
WHERE dim_dates.calender_dt = (

    SELECT order_date
    FROM byroneji4734_staging.orders
    WHERE orders.product_id = (
        SELECT  product_id
        FROM byroneji4734_staging.reviews
        GROUP BY product_id 
        ORDER BY count(review) DESC
        LIMIT 1
    )
    ORDER BY quantity DESC
    LIMIT 1
    )

Query started at 10:11:58 PM W. Central Africa Standard Time; Query executed in 0.00 m

  calender_dt  day_of_the_week_num  working_day
0  2021-05-04                    2         True

In [16]:
%%read_sql

SELECT product_id, order_date, count(order_id) as tt_orders
FROM byroneji4734_staging.orders

WHERE orders.product_id = (

    SELECT orders.product_id
    FROM byroneji4734_staging.orders
    WHERE orders.product_id = (
        SELECT  product_id
        FROM byroneji4734_staging.reviews
        GROUP BY product_id 
        ORDER BY count(review) DESC
        LIMIT 1
    )

    LIMIT 1
    )
GROUP BY  orders.product_id, order_date
ORDER BY tt_orders DESC

LIMIT 1

Query started at 10:12:02 PM W. Central Africa Standard Time; Query executed in 0.00 m

   product_id  order_date  tt_orders
0          23  2022-03-06          5

In [17]:
%%read_sql

SELECT CURRENT_DATE AS ingestion_date,product_name,order_date AS most_ordered_day,sum(review)AS tt_review_points, 
          bool_and(working_day = False AND day_of_the_week_num BETWEEN 1 AND 5)AS is_public_holiday,
                  ROUND(COUNT(*) * 1.0 / SUM(COUNT(*)) 
          OVER (PARTITION BY review=1), 3) as pct_one_star_review,
          
                  ROUND(COUNT(*) * 1.0 / SUM(COUNT(*)) 
          OVER (PARTITION BY review=2), 3) as pct_two_star_review,
          
                  ROUND(COUNT(*) * 1.0 / SUM(COUNT(*)) 
          OVER (PARTITION BY review=3), 3) as pct_three_star_review,
          
                  ROUND(COUNT(*) * 1.0 / SUM(COUNT(*)) 
          OVER (PARTITION BY review=4), 3) as pct_four_star_review,
          
                  ROUND(COUNT(*) * 1.0 / SUM(COUNT(*)) 
          OVER (PARTITION BY review=5), 3) as pct_five_star_review
          
FROM byroneji4734_staging.reviews

JOIN byroneji4734_staging.dim_products
ON dim_products.product_id = reviews.product_id

JOIN  byroneji4734_staging.orders
ON orders.product_id = dim_products.product_id
 

JOIN byroneji4734_staging.dim_dates
ON dim_dates.calender_dt = orders.order_date
WHERE dim_dates.calender_dt = (

    SELECT order_date
    FROM byroneji4734_staging.orders
    WHERE orders.product_id = (
        SELECT  product_id
        FROM byroneji4734_staging.reviews
        GROUP BY product_id,review
        ORDER BY sum(review) DESC
        LIMIT 1
    )
    GROUP BY product_id, order_date
    ORDER BY count(order_id) DESC
    LIMIT 1
    )
GROUP BY dim_products.product_id, orders.order_date, working_day, day_of_the_week_num, review
ORDER BY tt_review_points DESC
LIMIT 1

Query started at 10:12:07 PM W. Central Africa Standard Time; Query executed in 0.00 m

,ingestion_date,product_name,most_ordered_day,tt_review_points,is_public_holiday,pct_one_star_review,pct_two_star_review,pct_three_star_review,pct_four_star_review,pct_five_star_review
0,2022-09-27,Automotive,2022-01-06,2840,False,0.042,0.042,0.041,0.042,0.161

HIGHEST REVIEW

In [18]:
%%read_sql


SELECT sum(review) AS tt_review_points, reviews.product_id
FROM byroneji4734_staging.reviews
GROUP BY reviews.product_id
ORDER BY sum(review) DESC
LIMIT 1

Query started at 10:12:13 PM W. Central Africa Standard Time; Query executed in 0.00 m

   tt_review_points  product_id
0              1934          22

In [4]:
%%read_sql

SELECT CURRENT_DATE AS ingestion_date, reviews.product_id, product_name, sum(review) AS tt_review_points
FROM if_common.dim_products 

    JOIN byroneji4734_staging.reviews
    ON reviews.product_id = dim_products.product_id

    JOIN 
 
WHERE dim_products.product_id = 
 (
SELECT reviews.product_id
FROM byroneji4734_staging.reviews
GROUP BY reviews.product_id
ORDER BY sum(review) DESC
LIMIT 1

 )

GROUP BY reviews.product_id, product_name

Query started at 11:02:28 PM W. Central Africa Standard Time; Query executed in 0.01 m

  ingestion_date  product_id product_name  tt_review_points
0     2022-09-27          22      Scooter              1934

ORDERS

In [6]:
%%read_sql

SELECT order_date AS most_ordered_day, bool_and(working_day = False AND day_of_the_week_num BETWEEN 1 AND 5)AS is_public_holiday
FROM byroneji4734_staging.orders


WHERE orders.product_id = 
(
    SELECT reviews.product_id
    FROM byroneji4734_staging.reviews
    GROUP BY reviews.product_id
    ORDER BY sum(review) DESC
    LIMIT 1
    
)

GROUP BY  order_date, orders.product_id
ORDER BY sum (quantity) DESC
LIMIT 1

Query started at 11:08:21 PM W. Central Africa Standard Time; Query executed in 0.00 m

  most_ordered_day  product_id
0       2022-01-06          22

In [9]:
%%read_sql

SELECT calendar_dt AS most_ordered_day, bool_and(working_day = False AND day_of_the_week_num BETWEEN 1 AND 5)AS is_public_holiday
FROM if_common.dim_dates
WHERE dim_dates.calendar_dt = 
(

SELECT order_date
FROM byroneji4734_staging.orders


WHERE orders.product_id = 
(
    SELECT reviews.product_id
    FROM byroneji4734_staging.reviews
    GROUP BY reviews.product_id
    ORDER BY sum(review) DESC
    LIMIT 1
    
)

GROUP BY  order_date, orders.product_id
ORDER BY sum (quantity) DESC
LIMIT 1

)
GROUP BY calendar_dt

Query started at 11:15:02 PM W. Central Africa Standard Time; Query executed in 0.01 m

  most_ordered_day  is_public_holiday
0       2022-01-06              False